MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH124/mcu.h
extern volatile __PB5DIVbits_t PB5DIVbits __asm__ ("PB5DIV") __attribute__((section("sfrs"), address(0xBF801340)));
extern volatile uint32_t        PB5DIVCLR __attribute__((section("sfrs"),address(0xBF801344)));
extern volatile uint32_t        PB5DIVSET __attribute__((section("sfrs"),address(0xBF801348)));
extern volatile uint32_t        PB5DIVINV __attribute__((section("sfrs"),address(0xBF80134C)));
#define PB7DIV PB7DIV
extern volatile uint32_t   PB7DIV __attribute__((section("sfrs"), address(0xBF801360)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB7DIVbits_t;
extern volatile __PB7DIVbits_t PB7DIVbits __asm__ ("PB7DIV") __attribute__((section("sfrs"), address(0xBF801360)));
extern volatile uint32_t        PB7DIVCLR __attribute__((section("sfrs"),address(0xBF801364)));
extern volatile uint32_t        PB7DIVSET __attribute__((section("sfrs"),address(0xBF801368)));
extern volatile uint32_t        PB7DIVINV __attribute__((section("sfrs"),address(0xBF80136C)));
#define PB8DIV PB8DIV
extern volatile uint32_t   PB8DIV __attribute__((section("sfrs"), address(0xBF801370)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB8DIVbits_t;
extern volatile __PB8DIVbits_t PB8DIVbits __asm__ ("PB8DIV") __attribute__((section("sfrs"), address(0xBF801370)));
extern volatile uint32_t        PB8DIVCLR __attribute__((section("sfrs"),address(0xBF801374)));
extern volatile uint32_t        PB8DIVSET __attribute__((section("sfrs"),address(0xBF801378)));
extern volatile uint32_t        PB8DIVINV __attribute__((section("sfrs"),address(0xBF80137C)));
#define INT1R INT1R
extern volatile uint32_t   INT1R __attribute__((section("sfrs"), address(0xBF801404)));
typedef struct {
  uint32_t INT1R:4;
} __INT1Rbits_t;
extern volatile __INT1Rbits_t INT1Rbits __asm__ ("INT1R") __attribute__((section("sfrs"), address(0xBF801404)));
#define INT2R INT2R
extern volatile uint32_t   INT2R __attribute__((section("sfrs"), address(0xBF801408)));
typedef struct {
  uint32_t INT2R:4;
} __INT2Rbits_t;
extern volatile __INT2Rbits_t INT2Rbits __asm__ ("INT2R") __attribute__((section("sfrs"), address(0xBF801408)));
#define INT3R INT3R
extern volatile uint32_t   INT3R __attribute__((section("sfrs"), address(0xBF80140C)));
typedef struct {
  uint32_t INT3R:4;
} __INT3Rbits_t;
extern volatile __INT3Rbits_t INT3Rbits __asm__ ("INT3R") __attribute__((section("sfrs"), address(0xBF80140C)));
#define INT4R INT4R
extern volatile uint32_t   INT4R __attribute__((section("sfrs"), address(0xBF801410)));
typedef struct {
  uint32_t INT4R:4;
} __INT4Rbits_t;
extern volatile __INT4Rbits_t INT4Rbits __asm__ ("INT4R") __attribute__((section("sfrs"), address(0xBF801410)));
#define T2CKR T2CKR
extern volatile uint32_t   T2CKR __attribute__((section("sfrs"), address(0xBF801418)));
typedef struct {
  uint32_t T2CKR:4;
} __T2CKRbits_t;
extern volatile __T2CKRbits_t T2CKRbits __asm__ ("T2CKR") __attribute__((section("sfrs"), address(0xBF801418)));
#define T3CKR T3CKR
extern volatile uint32_t   T3CKR __attribute__((section("sfrs"), address(0xBF80141C)));
typedef struct {
  uint32_t T3CKR:4;
} __T3CKRbits_t;
extern volatile __T3CKRbits_t T3CKRbits __asm__ ("T3CKR") __attribute__((section("sfrs"), address(0xBF80141C)));
#define T4CKR T4CKR
extern volatile uint32_t   T4CKR __attribute__((section("sfrs"), address(0xBF801420)));
typedef struct {
  uint32_t T4CKR:4;
} __T4CKRbits_t;
extern volatile __T4CKRbits_t T4CKRbits __asm__ ("T4CKR") __attribute__((section("sfrs"), address(0xBF801420)));
#define T5CKR T5CKR
extern volatile uint32_t   T5CKR __attribute__((section("sfrs"), address(0xBF801424)));
typedef struct {
  uint32_t T5CKR:4;
} __T5CKRbits_t;
extern volatile __T5CKRbits_t T5CKRbits __asm__ ("T5CKR") __attribute__((section("sfrs"), address(0xBF801424)));
#define T6CKR T6CKR
extern volatile uint32_t   T6CKR __attribute__((section("sfrs"), address(0xBF801428)));
typedef struct {
  uint32_t T6CKR:4;
} __T6CKRbits_t;
extern volatile __T6CKRbits_t T6CKRbits __asm__ ("T6CKR") __attribute__((section("sfrs"), address(0xBF801428)));
#define T7CKR T7CKR
extern volatile uint32_t   T7CKR __attribute__((section("sfrs"), address(0xBF80142C)));
typedef struct {
  uint32_t T7CKR:4;
} __T7CKRbits_t;
extern volatile __T7CKRbits_t T7CKRbits __asm__ ("T7CKR") __attribute__((section("sfrs"), address(0xBF80142C)));
#define T8CKR T8CKR
extern volatile uint32_t   T8CKR __attribute__((section("sfrs"), address(0xBF801430)));
typedef struct {
  uint32_t T8CKR:4;
} __T8CKRbits_t;
extern volatile __T8CKRbits_t T8CKRbits __asm__ ("T8CKR") __attribute__((section("sfrs"), address(0xBF801430)));
#define T9CKR T9CKR
extern volatile uint32_t   T9CKR __attribute__((section("sfrs"), address(0xBF801434)));
typedef struct {
  uint32_t T9CKR:4;
} __T9CKRbits_t;
extern volatile __T9CKRbits_t T9CKRbits __asm__ ("T9CKR") __attribute__((section("sfrs"), address(0xBF801434)));
#define IC1R IC1R
extern volatile uint32_t   IC1R __attribute__((section("sfrs"), address(0xBF801438)));
typedef struct {
  uint32_t IC1R:4;
} __IC1Rbits_t;
extern volatile __IC1Rbits_t IC1Rbits __asm__ ("IC1R") __attribute__((section("sfrs"), address(0xBF801438)));
#define IC2R IC2R
extern volatile uint32_t   IC2R __attribute__((section("sfrs"), address(0xBF80143C)));
typedef struct {
  uint32_t IC2R:4;
} __IC2Rbits_t;
extern volatile __IC2Rbits_t IC2Rbits __asm__ ("IC2R") __attribute__((section("sfrs"), address(0xBF80143C)));
#define IC3R IC3R
extern volatile uint32_t   IC3R __attribute__((section("sfrs"), address(0xBF801440)));
typedef struct {
  uint32_t IC3R:4;
} __IC3Rbits_t;
extern volatile __IC3Rbits_t IC3Rbits __asm__ ("IC3R") __attribute__((section("sfrs"), address(0xBF801440)));
#define IC4R IC4R
extern volatile uint32_t   IC4R __attribute__((section("sfrs"), address(0xBF801444)));
typedef struct {
  uint32_t IC4R:4;
} __IC4Rbits_t;
extern volatile __IC4Rbits_t IC4Rbits __asm__ ("IC4R") __attribute__((section("sfrs"), address(0xBF801444)));
#define IC5R IC5R
extern volatile uint32_t   IC5R __attribute__((section("sfrs"), address(0xBF801448)));
typedef struct {
  uint32_t IC5R:4;
} __IC5Rbits_t;
extern volatile __IC5Rbits_t IC5Rbits __asm__ ("IC5R") __attribute__((section("sfrs"), address(0xBF801448)));
#define IC6R IC6R
extern volatile uint32_t   IC6R __attribute__((section("sfrs"), address(0xBF80144C)));
typedef struct {
  uint32_t IC6R:4;
} __IC6Rbits_t;
