MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH124/mcu.h
#define _AD1DSTAT2_ARDY34_POSITION               0x00000002
#define _AD1DSTAT2_ARDY34_MASK                   0x00000004
#define _AD1DSTAT2_ARDY34_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY35_POSITION               0x00000003
#define _AD1DSTAT2_ARDY35_MASK                   0x00000008
#define _AD1DSTAT2_ARDY35_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY36_POSITION               0x00000004
#define _AD1DSTAT2_ARDY36_MASK                   0x00000010
#define _AD1DSTAT2_ARDY36_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY37_POSITION               0x00000005
#define _AD1DSTAT2_ARDY37_MASK                   0x00000020
#define _AD1DSTAT2_ARDY37_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY38_POSITION               0x00000006
#define _AD1DSTAT2_ARDY38_MASK                   0x00000040
#define _AD1DSTAT2_ARDY38_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY39_POSITION               0x00000007
#define _AD1DSTAT2_ARDY39_MASK                   0x00000080
#define _AD1DSTAT2_ARDY39_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY40_POSITION               0x00000008
#define _AD1DSTAT2_ARDY40_MASK                   0x00000100
#define _AD1DSTAT2_ARDY40_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY41_POSITION               0x00000009
#define _AD1DSTAT2_ARDY41_MASK                   0x00000200
#define _AD1DSTAT2_ARDY41_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY42_POSITION               0x0000000A
#define _AD1DSTAT2_ARDY42_MASK                   0x00000400
#define _AD1DSTAT2_ARDY42_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY43_POSITION               0x0000000B
#define _AD1DSTAT2_ARDY43_MASK                   0x00000800
#define _AD1DSTAT2_ARDY43_LENGTH                 0x00000001

#define _AD1DSTAT2_ARDY44_POSITION               0x0000000C
#define _AD1DSTAT2_ARDY44_MASK                   0x00001000
#define _AD1DSTAT2_ARDY44_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE0_POSITION                0x00000000
#define _AD1CMPEN1_CMPE0_MASK                    0x00000001
#define _AD1CMPEN1_CMPE0_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE1_POSITION                0x00000001
#define _AD1CMPEN1_CMPE1_MASK                    0x00000002
#define _AD1CMPEN1_CMPE1_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE2_POSITION                0x00000002
#define _AD1CMPEN1_CMPE2_MASK                    0x00000004
#define _AD1CMPEN1_CMPE2_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE3_POSITION                0x00000003
#define _AD1CMPEN1_CMPE3_MASK                    0x00000008
#define _AD1CMPEN1_CMPE3_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE4_POSITION                0x00000004
#define _AD1CMPEN1_CMPE4_MASK                    0x00000010
#define _AD1CMPEN1_CMPE4_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE5_POSITION                0x00000005
#define _AD1CMPEN1_CMPE5_MASK                    0x00000020
#define _AD1CMPEN1_CMPE5_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE6_POSITION                0x00000006
#define _AD1CMPEN1_CMPE6_MASK                    0x00000040
#define _AD1CMPEN1_CMPE6_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE7_POSITION                0x00000007
#define _AD1CMPEN1_CMPE7_MASK                    0x00000080
#define _AD1CMPEN1_CMPE7_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE8_POSITION                0x00000008
#define _AD1CMPEN1_CMPE8_MASK                    0x00000100
#define _AD1CMPEN1_CMPE8_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE9_POSITION                0x00000009
#define _AD1CMPEN1_CMPE9_MASK                    0x00000200
#define _AD1CMPEN1_CMPE9_LENGTH                  0x00000001

#define _AD1CMPEN1_CMPE10_POSITION               0x0000000A
#define _AD1CMPEN1_CMPE10_MASK                   0x00000400
#define _AD1CMPEN1_CMPE10_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE11_POSITION               0x0000000B
#define _AD1CMPEN1_CMPE11_MASK                   0x00000800
#define _AD1CMPEN1_CMPE11_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE12_POSITION               0x0000000C
#define _AD1CMPEN1_CMPE12_MASK                   0x00001000
#define _AD1CMPEN1_CMPE12_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE13_POSITION               0x0000000D
#define _AD1CMPEN1_CMPE13_MASK                   0x00002000
#define _AD1CMPEN1_CMPE13_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE14_POSITION               0x0000000E
#define _AD1CMPEN1_CMPE14_MASK                   0x00004000
#define _AD1CMPEN1_CMPE14_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE15_POSITION               0x0000000F
#define _AD1CMPEN1_CMPE15_MASK                   0x00008000
#define _AD1CMPEN1_CMPE15_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE16_POSITION               0x00000010
#define _AD1CMPEN1_CMPE16_MASK                   0x00010000
#define _AD1CMPEN1_CMPE16_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE17_POSITION               0x00000011
#define _AD1CMPEN1_CMPE17_MASK                   0x00020000
#define _AD1CMPEN1_CMPE17_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE18_POSITION               0x00000012
#define _AD1CMPEN1_CMPE18_MASK                   0x00040000
#define _AD1CMPEN1_CMPE18_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE19_POSITION               0x00000013
#define _AD1CMPEN1_CMPE19_MASK                   0x00080000
#define _AD1CMPEN1_CMPE19_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE20_POSITION               0x00000014
#define _AD1CMPEN1_CMPE20_MASK                   0x00100000
#define _AD1CMPEN1_CMPE20_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE21_POSITION               0x00000015
#define _AD1CMPEN1_CMPE21_MASK                   0x00200000
#define _AD1CMPEN1_CMPE21_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE22_POSITION               0x00000016
#define _AD1CMPEN1_CMPE22_MASK                   0x00400000
#define _AD1CMPEN1_CMPE22_LENGTH                 0x00000001

#define _AD1CMPEN1_CMPE23_POSITION               0x00000017
#define _AD1CMPEN1_CMPE23_MASK                   0x00800000
#define _AD1CMPEN1_CMPE23_LENGTH                 0x00000001

